app/controllers/devices_controller.rb

  def show
    @irr_measures = Device.find( params[:id] ).irradiance_measures.select('time, measure')
---
SELECT time, measure FROM "irradiance_measures" WHERE "irradiance_measures"."device_id" = ?  [["device_id", 1]]